---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.Insert(Autodesk.Revit.DB.CurtainGrid)
source: html/d75605e1-d266-199d-a198-bb2f34219468.htm
---
# Autodesk.Revit.DB.CurtainGridSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	CurtainGrid item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CurtainGrid`)